Обучение_8310/src/Documents/ДвижениеПоРБ/ДвижениеПоРБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеПоРБ</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии1</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Обучение_8310/src/AccountingRegisters/РегистрБухгалтерии1/РегистрБухгалтерии1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии1</name>
  <chartOfAccounts>ChartOfAccounts.ПланСчетов1</chartOfAccounts>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Обучение_8310/src/ChartsOfAccounts/ПланСчетов1/ПланСчетов1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланСчетов1</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ПланВидовХарактеристик1</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РС</name>
      <description>Касса</description>
      <code>51</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ОС</name>
      <description>ОС</description>
      <code>01</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <extDimensionAccountingFlags>
    <name>ПризнакУчетаСубконто1</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Обучение_8310/src/Documents/ДвижениеПоРБ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрБухгалтерии1 Дебет
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Дебет;
		Движение.Счет = ПланыСчетов.ПланСчетов1.Товары;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;

	// регистр РегистрБухгалтерии1 Кредит
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Кредит;
		Движение.Счет = ПланыСчетов.ПланСчетов1.Касса;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;
	
	Движения.Записать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
